{
    "id": 691,
    "title": "Stickers to Spell Word",
    "title_slug": "stickers-to-spell-word",
    "backend_id": 691,
    "content": "<div><p>\nWe are given N different types of stickers.  Each sticker has a lowercase English word on it.\n</p><p>\nYou would like to spell out the given <code>target</code> string by cutting individual letters from your collection of stickers and rearranging them.\n</p><p>\nYou can use each sticker more than once if you want, and you have infinite quantities of each sticker.\n</p><p>\nWhat is the minimum number of stickers that you need to spell out the <code>target</code>?  If the task is impossible, return -1.\n</p>\n\n<p><b>Example 1:</b></p>\n<p>Input:</p><pre>[\"with\", \"example\", \"science\"], \"thehat\"\n</pre><p></p>\n\n<p>Output:</p><pre>3\n</pre><p></p>\n\n<p>Explanation:</p><pre>We can use 2 \"with\" stickers, and 1 \"example\" sticker.\nAfter cutting and rearrange the letters of those stickers, we can form the target \"thehat\".\nAlso, this is the minimum number of stickers necessary to form the target string.\n</pre><p></p>\n\n<p><b>Example 2:</b></p>\n<p>Input:</p><pre>[\"notice\", \"possible\"], \"basicbasic\"\n</pre><p></p>\n\n<p>Output:</p><pre>-1\n</pre><p></p>\n\n<p>Explanation:</p><pre>We can't form the target \"basicbasic\" from cutting letters from the given stickers.\n</pre><p></p>\n\n<p><b>Note:</b>\n</p><li><code>stickers</code> has length in the range <code>[1, 50]</code>.</li>\n<li><code>stickers</code> consists of lowercase English words (without apostrophes).</li>\n<li><code>target</code> has length in the range <code>[1, 15]</code>, and consists of lowercase English letters.</li>\n<li>In all test cases, all words were chosen <u>randomly</u> from the 1000 most common US English words, and the target was chosen as a concatenation of two random words.</li>\n<li>The time limit may be more challenging than usual.  It is expected that a 50 sticker test case can be solved within 35ms on average.</li>\n<p></p></div>"
}